run/conjugateBatteryCC_EVFvsMPR/0/a
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      a;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -2 0 0 -1 0];

internalField   uniform (0 0 0);

boundaryField
{
    liquidToSteelInterface
    {
    type		fixedValue;
    value		uniform (0 0 0);
    }
    liquidToLithiumInterface
    {
    type		fixedValue;
    value		uniform (0 0 0);
    }
    topSurface
    {
    type		fixedValue;
    value		uniform (0 0 0);
    }
}

// ************************************************************************* //
